In [1]:
import numpy as np
import pandas as pd
import mysql.connector

In [2]:
mydb= mysql.connector.connect(
    host='localhost',
    user='root',
    passwd='rama16rra',
    database='sakila'
)

In [3]:
mycursor= mydb.cursor()
mycursor.execute('''
show full tables
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

In [29]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from film limit 2
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42

In [45]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from actor limit 2
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33
1         2       NICK  WAHLBERG 2006-02-15 04:34:33

In [46]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from film_actor limit 2
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03

In [57]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from category limit 2
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27

# 1
Soal : Buatlah file jupyter (.ipynb) bernama PyMySQL dan buat connection Python dengan server MySQL Anda, lalu gunakan database sakila. Tuliskan langkah-langkah/query MySQL dan tampilkan hasilnya berupa DataFrame. Anda dilarang membuat database baru, merubah struktur table, membuat view atau segala bentuk tindakan yang mengubah struktur database.

Tampilkan daftar 10 film komedi dengan durasi tersingkat. Urutkan data berdasarkan film dengan urasi terpendek. Kolom yang diwajibkan tampil adalah title, category dan length. Output yang diharapkan:

In [19]:
mycursor= mydb.cursor()
mycursor.execute('''
select film.title, category.name as category, min(film.length) as leght
from film, category, film_category
where (category.name = 'Comedy') and (film.film_id=film_category.film_id) and (category.category_id=film_category.category_id)
group by film.title, category.name
ORDER BY film.length
limit 10
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

              title category  leght
0   DOWNHILL ENOUGH   Comedy     47
1  PARADISE SABRINA   Comedy     48
2    HEAVEN FREEDOM   Comedy     48
3  HURRICANE AFFAIR   Comedy     49
4        LION UNCUT   Comedy     50
5         ZORRO ARK   Comedy     50
6       CLOSER BANG   Comedy     58
7   AIRPLANE SIERRA   Comedy     62
8   LONELY ELEPHANT   Comedy     67
9      DOOM DANCING   Comedy     68

*penjelasan no 1

1. yang pertama membuat kolom tabel yg di inginkan, yaitu ilm.title, category.name as category, min(film.length) as leght menggunakan query select. Penggunaan min(film.length) bertujuan untuk mendapatkan nilai terkecil dari kolom film.length
2. memasukkan asal tabel. karena dalam soal ini kita harus melakukan join. tabel tersebut adalah film, category, film_category
3. selanjutnya kita membuat syarat yaitu category.name= 'comedy'
4. melakukan inplisit join dengan (film.film_id=film_category.film_id) and (category.category_id=film_category.category_id)
5. melakukan group by untuk menggupkan film.title, category.name dan juga agar bisa di order
6. selanjutnya melakukan order berdasarkan film.length yang sudah kita masukkan query min sebelumnya
7. membatasi data menjadi 10 dengan imit 10

# 2
Tampilkan daftar lengkap kategori film beserta jumlah film tiap kategori & rata-rata harga sewa DVD film tiap kategori. Urutkan data dari kategori dengan jumlah film terbanyak. Kolom yang diwajibkan ada minimal adalah kategori, jumlah film dan rata-rata harga sewa. Output yang diharapkan:

In [ ]:
film.rental_rate
category.name

In [43]:
mycursor= mydb.cursor()
mycursor.execute('''
select category.name as Category, count(film.title) as JumlahMovie, avg(film.rental_rate) as RataHargaSewa
from film, category, film_category
where (film.film_id=film_category.film_id) and (category.category_id=film_category.category_id)
group by category.name
ORDER BY film.title ASC
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

       Category  JumlahMovie RataHargaSewa
0   Documentary           68      2.666471
1        Horror           56      3.025714
2        Family           69      2.758116
3       Foreign           73      3.099589
4        Comedy           58      3.162414
5        Sports           74      3.125135
6         Music           51      2.950784
7      Classics           57      2.744386
8     Animation           66      2.808182
9        Action           64      2.646250
10          New           63      3.116984
11       Sci-Fi           61      3.219508
12        Drama           62      3.022258
13       Travel           57      3.235614
14        Games           61      3.252295
15     Children           60      2.890000

*Penjelasan no 2

1. yang pertama membuat kolom tabel yg di inginkan, category.name as Category, count(film.title) as JumlahMovie, avg(film.rental_rate) as RataHargaSewa menggunakan query select. Penggunaan count(film.title) bertujuan untuk menghitung jumlah film. Penggunaan avg(film.rental_rate) bertujuan untuk menghitung avg dri rental_rate
2. memasukkan asal tabel. karena dalam soal ini kita harus melakukan join. tabel tersebut adalah film, category, film_category
3. melakukan inplisit join dengan (film.film_id=film_category.film_id) and (category.category_id=film_category.category_id)
4. melakukan group by untuk menggupkan  category.name dan juga agar bisa di order
5. selanjutnya melakukan order berdasarkan film.title yang sudah kita sebelumnya lalu di tambah asc untuk membuat dri besar ke kecil

# 3

Tampilkan daftar 10 aktor/aktris yang paling banyak membintangi film. Kolom yang ditampilkan minimal: id aktor, nama depan, nama belakang dan jumlah film yang dibintangi. Kemudian urutkan dari aktor/aktris yang membintangi film terbanyak. Output yang diharapkan:

In [51]:
mycursor= mydb.cursor()
mycursor.execute('''
select actor.actor_id, actor.first_name, actor.last_name, count(film.title) as JumlahMovie
from film, actor, film_actor
where (film.film_id=film_actor.film_id) and (actor.actor_id=film_actor.actor_id)
group by actor.actor_id
ORDER BY film.title ASC
limit 10
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

   actor_id first_name last_name  JumlahMovie
0         1   PENELOPE   GUINESS           19
1       162      OPRAH    KILMER           25
2        40     JOHNNY      CAGE           29
3       188       ROCK   DUKAKIS           30
4        20    LUCILLE     TRACY           30
5        53       MENA    TEMPLE           30
6       108     WARREN     NOLTE           34
7       198       MARY    KEITEL           40
8        10  CHRISTIAN     GABLE           22
9        30     SANDRA      PECK           19

*Penjelasan no 3

1. yang pertama membuat kolom tabel yg di inginkan, select actor.actor_id, actor.first_name, actor.last_name, count(film.title) as JumlahMovie menggunakan query select. Penggunaan count(film.title) bertujuan untuk menghitung jumlah film. Penggunaan avg(film.rental_rate) bertujuan untuk menghitung avg dri rental_rate
2. memasukkan asal tabel. karena dalam soal ini kita harus melakukan join. tabel tersebut adalah film, actor, film_actor
3. melakukan inplisit join dengan (film.film_id=film_actor.film_id) and (actor.actor_id=film_actor.actor_id)
4. melakukan group by untuk menggupkan  actor.actor_id dan juga agar bisa di order
5. selanjutnya melakukan order berdasarkan film.title yang sudah kita sebelumnya lalu di tambah asc untuk membuat dri besar ke kecil
6. membuat limit 10

# 4
Dari soal sebelumnya diketahui Gina Degeneres merupakan aktris yang paling banyak membintangi film, dengan total 42 judul film. Kategori film apakah yang paling banyak dibintanginya? Untuk mengetahuinya, tampilkan daftar kategori film beserta jumlah film yang pernah dibintangi oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu kategori film dan jumlah film yang dibintangi. Output yang diharapkan:

In [64]:
mycursor= mydb.cursor()
mycursor.execute('''
select category.name as Category, count(film.title) as Jumlah_Movie
from film, actor, film_actor, category, film_category
where (actor.first_name= 'GINA') and (actor.last_name='DEGENERES') and (film.film_id=film_actor.film_id) and (actor.actor_id=film_actor.actor_id) and (film.film_id=film_category.film_id) and (category.category_id=film_category.category_id)
group by category.name
ORDER BY film.title
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

       Category  Jumlah_Movie
0   Documentary             3
1       Foreign             2
2         Music             4
3           New             1
4        Sci-Fi             7
5        Action             3
6         Drama             2
7     Animation             4
8        Horror             1
9        Family             4
10       Comedy             3
11     Children             2
12     Classics             2
13       Sports             2
14        Games             1
15       Travel             1

*Penjelasan no 4

1. yang pertama membuat kolom tabel yg di inginkan, category.name as Category, count(film.title) as Jumlah_Movie menggunakan query select. Penggunaan count(film.title) bertujuan untuk menghitung jumlah film. 
2. memasukkan asal tabel. karena dalam soal ini kita harus melakukan join. tabel tersebut adalah film, actor, film_actor, category, film_category
3. melakukan inplisit join dengan (film.film_id=film_actor.film_id) and (actor.actor_id=film_actor.actor_id) and (film.film_id=film_category.film_id) and (category.category_id=film_category.category_id)
4. membuat syarat dengan where (actor.first_name= 'GINA') and (actor.last_name='DEGENERES')
5. melakukan group by untuk menggupkan  category.name dan juga agar bisa di order
6. selanjutnya melakukan order berdasarkan film.title

# 5
Dari soal sebelumnya diketahui Gina Degeneres paling banyak membintangi film bergenre sciencefiction, dengan total 7 judul film. Tampilkan daftar judul film sci-fi yang pernah dibintangi oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu judul film dan kategorinya. Output yang diharapkan:

In [71]:
mycursor= mydb.cursor()
mycursor.execute('''
select film.title as title, category.name as category
from film, actor, film_actor, category, film_category
where (actor.first_name= 'GINA') and (actor.last_name='DEGENERES') and (category.name='Sci-Fi') and  (film.film_id=film_actor.film_id) and (actor.actor_id=film_actor.actor_id) and (film.film_id=film_category.film_id) and (category.category_id=film_category.category_id)
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

                 title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi

In [ ]:
*Penjelasan no 5

1. yang pertama membuat kolom tabel yg di inginkan, film.title as title, category.name as category menggunakan query select.
2. memasukkan asal tabel. karena dalam soal ini kita harus melakukan join. tabel tersebut adalah film, actor, film_actor, category, film_category
3. melakukan inplisit join dengan (film.film_id=film_actor.film_id) and (actor.actor_id=film_actor.actor_id) and (film.film_id=film_category.film_id) and (category.category_id=film_category.category_id)
4. membuat syarat dengan where (actor.first_name= 'GINA') and (actor.last_name='DEGENERES') and (category.name='Sci-Fi')